{
  "_name_or_path": "",
  "add_cross_attention": false,
  "architectures": null,
  "bad_words_ids": null,
  "begin_suppress_tokens": null,
  "bos_token_id": null,
  "chunk_size_feed_forward": 0,
  "cross_attention_hidden_size": null,
  "decoder_start_token_id": null,
  "discriminator_act_after_linear": false,
  "discriminator_causal": true,
  "discriminator_depth": 1,
  "discriminator_dilation": 1,
  "discriminator_dim": 256,
  "discriminator_dropout": 0.0,
  "discriminator_input_dim": 51,
  "discriminator_kernel": 3,
  "discriminator_linear_emb": false,
  "discriminator_max_pool": false,
  "discriminator_spectral_norm": false,
  "discriminator_weight_norm": false,
  "diversity_penalty": 0.0,
  "do_sample": false,
  "early_stopping": false,
  "encoder_no_repeat_ngram_size": 0,
  "eos_token_id": null,
  "exponential_decay_length_penalty": null,
  "finetuning_task": null,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "generator_bias": false,
  "generator_bn_apply": false,
  "generator_bn_init_weight": 30.0,
  "generator_dilation": 1,
  "generator_dropout": 0.0,
  "generator_input_dim": 512,
  "generator_kernel": 4,
  "generator_output_dim": 51,
  "generator_stride": 1,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "is_decoder": false,
  "is_encoder_decoder": false,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "length_penalty": 1.0,
  "max_length": 20,
  "min_length": 0,
  "model_type": "reborn_uasr",
  "no_repeat_ngram_size": 0,
  "num_beam_groups": 1,
  "num_beams": 1,
  "num_return_sequences": 1,
  "output_attentions": false,
  "output_hidden_states": false,
  "output_scores": false,
  "pad_token_id": null,
  "phones": [
    "s",
    "a",
    "i",
    "e",
    "o",
    "\u027e",
    "\u00e6",
    "\u014b",
    "d",
    "k",
    "t",
    "m",
    "\u028a",
    "r",
    "l",
    "e\u026a",
    "p",
    "y",
    "v",
    "u",
    "n",
    "z",
    "b",
    "\u0250\u0303",
    "\u0259",
    "t\u0283",
    "f",
    "\u0261",
    "x",
    "\u0250\u0303\u028a\u0303",
    "\u0292",
    "d\u0292",
    "w",
    "\u025b",
    "j",
    "\u0254",
    "a\u028a",
    "\u0283",
    "\u0272",
    "i\u028a",
    "u\u0303",
    "o\u0303",
    "a\u026a",
    "e\u028a",
    "\u025b\u028a",
    "\u028e",
    "<SIL>"
  ],
  "prefix": null,
  "problem_type": null,
  "pruned_heads": {},
  "remove_invalid_values": false,
  "repetition_penalty": 1.0,
  "return_dict": true,
  "return_dict_in_generate": false,
  "segmenter_dropout": 0.1,
  "segmenter_hidden_dim": 512,
  "segmenter_input_dim": 512,
  "segmenter_kernel_size": 7,
  "segmenter_type": "cnn",
  "sep_token_id": null,
  "special_token_nums": 4,
  "suppress_tokens": null,
  "task_specific_params": null,
  "temperature": 1.0,
  "tf_legacy_loss": false,
  "tie_encoder_decoder": false,
  "tie_word_embeddings": true,
  "tokenizer_class": null,
  "top_k": 50,
  "top_p": 1.0,
  "torch_dtype": null,
  "torchscript": false,
  "transformers_version": "4.24.0",
  "typical_p": 1.0,
  "use_bfloat16": false
}
